app/views/reservations/index.html.erb

SELECT  "golfclubs".* FROM "golfclubs" WHERE "golfclubs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "timeslots".* FROM "timeslots" WHERE "timeslots"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
      <th scope="row"><%=i%></th>
      <td><%=Golfclub.find(d.golfclub_id).name%></td>
      <td><%=Timeslot.find(d.timeslot_id).title%></td>