app/controllers/golfclubs_controller.rb

  def index
  	@clubs = Golfclub.all
---
SELECT "golfclubs".* FROM "golfclubs"

  def show
    @reservation = Reservation.new()
  	@golfclub = Golfclub.find(params[:id])
  	@times = @golfclub.timeslots.all
    # @timeslots = Timeslot.where("golfclub_id = ?", @golfclub.id)
    @timeslots = Timeslot.where({ golfclub_id: @golfclub.id,  available: true })
---
SELECT  "golfclubs".* FROM "golfclubs" WHERE "golfclubs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "timeslots".* FROM "timeslots" WHERE "timeslots"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "golfclubs".* FROM "golfclubs"
SELECT "timeslots".* FROM "timeslots" WHERE "timeslots"."golfclub_id" = $1 AND "timeslots"."available" = $2  [["golfclub_id", 1], ["available", "t"]]