app/controllers/reservations_controller.rb

SELECT "reservations".* FROM "reservations"
SELECT "timeslots".* FROM "timeslots"
---
	def index
		@reservations = Reservation.all
		@timeslots = Timeslot.all

SELECT  "golfclubs".* FROM "golfclubs" WHERE "golfclubs"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "timeslots".* FROM "timeslots" WHERE "timeslots"."golfclub_id" = $1  [["golfclub_id", 1]]
---
	def new
		@reservation = Reservation.new
		@golfclub = Golfclub.find(params[:id])
    @timeslots = Timeslot.where("golfclub_id = ?", @golfclub.id)

SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
	def show
	    @reservation = Reservation.find(params[:id])

INSERT INTO "reservations" ("user_id", "golfclub_id", "timeslot_id", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["golfclub_id", 2], ["timeslot_id", 6], ["date", "2017-01-07"], ["created_at", "2017-07-28 17:22:45.852256"], ["updated_at", "2017-07-28 17:22:45.852256"]]
SELECT  "timeslots".* FROM "timeslots" WHERE "timeslots"."id" = $1 ORDER BY "timeslots"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "reservations".* FROM "reservations" WHERE "reservations"."user_id" = $1  [["user_id", 1]]
UPDATE "timeslots" SET "available" = $1, "user_id" = $2, "updated_at" = $3 WHERE "timeslots"."id" = $4  [["available", "f"], ["user_id", 1], ["updated_at", "2017-07-11 19:12:12.990294"], ["id", 1]]
SELECT "timeslots".* FROM "timeslots"
SELECT  "golfclubs".* FROM "golfclubs" WHERE "golfclubs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def create
		@reservation = Reservation.new(reservation_params)
		@reservation.user = current_user
		if @reservation.save
			@timeslot = Timeslot.find(@reservation.timeslot_id)
			@timeslot.available = false
			@timeslot.user = current_user
			@timeslot.save
			render 'show'

		else
			if @reservation.errors.include?(:timeslot)
				redirect_to golfclub_path(@golfclub, id: @reservation.golfclub_id, :error=>true)
			end
			if @reservation.errors.include?(:overlap)

SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "timeslots".* FROM "timeslots" WHERE "timeslots"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "timeslots" SET "available" = $1, "user_id" = $2, "updated_at" = $3 WHERE "timeslots"."id" = $4  [["available", "t"], ["user_id", nil], ["updated_at", "2017-07-11 20:22:18.413201"], ["id", 3]]
DELETE FROM "reservations" WHERE "reservations"."id" = $1  [["id", 8]]
---
	def destroy
		@reservation = Reservation.find(params[:id])
		@timeslot = Timeslot.find(@reservation.timeslot_id)
		@timeslot.available = true
		@timeslot.user = nil
		@timeslot.save
		@reservation.destroy